Перем юТест;
Перем Прокси;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьСозданиеИВызовСтрелочника");

	Возврат ВсеТесты;
	
КонецФункции


Процедура ТестДолжен_ПроверитьСозданиеИВызовСтрелочника() Экспорт

	ОбъектОбработчик = ЗагрузитьСценарийИзСтроки("Функция ВыполнитьВычисление(Знач Ч1, Знач Ч2, Получилось) Экспорт
	                                              
	                                             |	Получилось = Истина;
	                                             |	Возврат Ч1 + Ч2;
	                                              
	                                             |КонецФункции
	|");

	Стрелочник = Новый WSСтрелочник("Пример", "хттп://ехампле.ком/односкриптово");
	Стрелочник.ДобавитьОбработчик(ОбъектОбработчик);
	
	Прокси = Стрелочник.СоздатьПрокси();
	
	Получилось = Ложь; // TODO: при `Получилось = Неопределено;` не работает, а должно 
	РезультатВычисления = Прокси.ВыполнитьВычисление(1, 2, Получилось);
	юТест.ПроверитьРавенство(РезультатВычисления, 3, "Вызов функции службы");
	юТест.ПроверитьРавенство(Получилось, Истина, "Выходной параметр службы");

КонецПроцедуры

